### Pandas (Panel Data)

Pandas provides high-level data structures and functions designed to make working with
structured or tabular data fast, easy, and expressive. Since its emergence in 2010, it has helped
enable Python to be a powerful and productive data analysis environment. 

The primary objects in pandas that will be used in this module are the DataFrame, a tabular, column-oriented data
structure with both row and column labels, and the Series, a one-dimensional labeled array
object.

Pandas blends the high-performance, array-computing ideas of NumPy with the flex‐ ible data
manipulation capabilities of spreadsheets and relational databases (such as SQL). It provides
sophisticated indexing functionality to make it easy to reshape, slice and dice, perform
aggregations, and select subsets of data.

While pandas adopts many coding idioms from NumPy, the biggest difference is that pandas is
designed for working with tabular or heterogeneous data. NumPy, by contrast, is best suited for
working with homogeneous numerical array data. 

Since becoming an open source project in
2010, pandas has matured into a quite large library that’s applicable in a broad set of real-world
use cases. The developer community has grown to over 800 distinct contributors, who’ve been
helping build the project as they’ve used it to solve their day-to-day data problems.

#### Introduction to pandas Data Structures

To get started with pandas, you will need to get comfortable with its two workhorse data 
structures: Series and DataFrame. 

While they are not a universal solution for every problem,
they provide a solid, easy-to-use basis for most applications.

Series
A Series is a one-dimensional array-like object containing a sequence of values (of similar
types to NumPy types) and an associated array of data labels, called its index. The simplest
Series is formed from only an array of data:

In [2]:
import pandas as pd
import numpy as np

In [3]:
obj = pd.Series([4,7,5,23,3]) # Takes an array, array-like, an iterable, a dictionary or scalar value
print(obj)

0     4
1     7
2     5
3    23
4     3
dtype: int64

In [4]:
obj = pd.Series(np.array([4,7,5,23,3]))
print(obj)

0     4
1     7
2     5
3    23
4     3
dtype: int32

In [5]:
obj = pd.Series([4,7, 2+3j, 'c', 23, 3])
print(obj)

0         4
1         7
2    (2+3j)
3         c
4        23
5         3
dtype: object

In [6]:
dict1 = {'e':0, 'b':(3,7,9), 'd': 2, 'c':4, 'a':5}

In [7]:
obj = pd.Series(dict1)

print(obj)
print(type(obj))

e            0
b    (3, 7, 9)
d            2
c            4
a            5
dtype: object
<class 'pandas.core.series.Series'>

In [8]:
print(obj.values)

[0 (3, 7, 9) 2 4 5]

In [9]:
obj['e']

0

In [10]:
# If index number not provided - defaults from 0 to no of datapoints - 1. If provided, index value must be of hashable 
# (immutable) datatype. Non unique values are permitted. Further, in case an operation is performed where duplicate indexes
# is a problem, it raises an error at that time.

# Also takes a name parameter which gives a name to the series. 

obj = pd.Series([4,7,5,23,3], index = list('abcde'), name = 'Trial')
print(obj)

a     4
b     7
c     5
d    23
e     3
Name: Trial, dtype: int64

In [11]:
# Dtype of the series can also be specified if required.

In [12]:
print(obj.index)

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [13]:
obj.index = [(1,2), (3,4), (5,6), (7,8), (9,0)] # Tuples can be used since they are immutable. However, it is unlikely to
# have use for tuples as indexes of a series of dataframe.

In [14]:
print(obj)

(1, 2)     4
(3, 4)     7
(5, 6)     5
(7, 8)    23
(9, 0)     3
Name: Trial, dtype: int64

In [15]:
obj.index = ['a','b', (2,7), 3,5]
print(obj)

a          4
b          7
(2, 7)     5
3         23
5          3
Name: Trial, dtype: int64

In [16]:
# In Pandas - Data alignment is intrinsic i.e. operations to the dataframe preserves the label - value mapping unless 
# explicitly re-defined.

In [17]:
# Since the series is essentially a label - value mapping, using the key to output the value is possible. 

print(obj['b'])

7

In [18]:
print(obj[(2,7)])

5

In [19]:
print(obj[['a', (2,7), 3]])

a          4
(2, 7)     5
3         23
Name: Trial, dtype: int64

In [20]:
# Note above how we pass a list object to the subscript call on the obj series. This is tye synatx to use when calling 

# values of multiple indices at the same time.

In [21]:
print(obj)

print(obj[obj>10]) # Here we are subscripting the items from obj Series, using a condition on the values.

a          4
b          7
(2, 7)     5
3         23
5          3
Name: Trial, dtype: int64
3    23
Name: Trial, dtype: int64

In [22]:
print('b' in obj)

True

In [23]:
print((2,7) in obj)

True

In [24]:
print(23 in obj)

False

In [25]:
print(23 in obj.values)

True

In [26]:
obj = obj*2 # Numpy type operations can be performed on the series.

print(obj)

a          8
b         14
(2, 7)    10
3         46
5          6
Name: Trial, dtype: int64

In [27]:
obj = obj/2

print(obj)

a          4.0
b          7.0
(2, 7)     5.0
3         23.0
5          3.0
Name: Trial, dtype: float64

In [28]:
obj2 = np.exp(obj)

print(obj2)

a         5.459815e+01
b         1.096633e+03
(2, 7)    1.484132e+02
3         9.744803e+09
5         2.008554e+01
Name: Trial, dtype: float64

In [29]:
print(obj)

a          4.0
b          7.0
(2, 7)     5.0
3         23.0
5          3.0
Name: Trial, dtype: float64

In [30]:
# Creating a series from a dictionary.

data = {'Ohio' : 35000, 'California' : 20000, 'New York State' : 50000, 'Illinois' : 25000}

series1 = pd.Series(data)

print(series1)

Ohio              35000
California        20000
New York State    50000
Illinois          25000
dtype: int64

In [68]:
data = {'Ohio' : 35000, 'California' : 20000, 'New York State' : 50000, 'Illinois' : 25000, 'Utah':15000}

series1 = pd.Series(data, index = sorted(data.keys()))

#series1 = pd.Series(data, index = sorted(['Ohio', 'California', 'New York State', 'Utah', 'Texas']))

print(series1)

California        20000
Illinois          25000
New York State    50000
Ohio              35000
Utah              15000
dtype: int64

In [32]:
#Note the following : 

#1. The values corresponding to the index labels was maintained. 
#2. The index with no value was added to the index list but took a value of 'NaN' which stands for 'Not a Number.' This is 
# how Pandas labels missing data or null values. From here on, missing data will equate to NaN or Null. 
#3. The value 'Illinois' not included in the index list was not included in the series.

In [33]:
# We can check if the series values are null with the following syntax:

print(pd.isnull(series1)) #Using the Pandas function on the series object.

California        False
New York State    False
Ohio              False
Texas              True
Utah              False
dtype: bool

In [34]:
print(pd.notnull(series1))

California         True
New York State     True
Ohio               True
Texas             False
Utah               True
dtype: bool

In [35]:
#Or using the method on the series instance

print(series1.isnull())

California        False
New York State    False
Ohio              False
Texas              True
Utah              False
dtype: bool

In [36]:
print(series1.notnull())

California         True
New York State     True
Ohio               True
Texas             False
Utah               True
dtype: bool

A useful Series feature for many applications is that it automatically aligns by index label in
arithmetic operations:

In [37]:
dict1 = {'Ohio' : 10000, 'California':20000, 'New York State': 15000}
dict2 = {'Texas':12000, 'Illinois' : 7000, 'California':5000, 'New York State': 5000}

series1 = pd.Series(dict1, index = sorted(['Ohio', 'California', 'New York State', 'Orlando']))
series2 = pd.Series(dict2, index = sorted(['Ohio', 'Texas', 'Illinois', 'California', 'New York State']))

print(series1, '\n'*3,series2)

California        20000.0
New York State    15000.0
Ohio              10000.0
Orlando               NaN
dtype: float64


 California         5000.0
Illinois           7000.0
New York State     5000.0
Ohio                  NaN
Texas             12000.0
dtype: float64

In [38]:
series3 = series1 + series2
print(series3)

California        25000.0
Illinois              NaN
New York State    20000.0
Ohio                  NaN
Orlando               NaN
Texas                 NaN
dtype: float64

In [39]:
# Note how the index values are now a set of all the values. However, wherever in the new series object - wherever there is
# a NaN alue the values have not been added since cannot perform the additional operation on different datatypes. And NaN is 
# NOT zero. It is a different datatype.

In [40]:
# The index can also take on a name parameter. 

series3.index.name = 'State Names'

print(series3)

State Names
California        25000.0
Illinois              NaN
New York State    20000.0
Ohio                  NaN
Orlando               NaN
Texas                 NaN
dtype: float64

In [41]:
series3.name = 'State buffalo population'

In [42]:
print(series3)

State Names
California        25000.0
Illinois              NaN
New York State    20000.0
Ohio                  NaN
Orlando               NaN
Texas                 NaN
Name: State buffalo population, dtype: float64

In [43]:
# An index can be altered inplace by assignment. 

series3.index = [1,2,3,4,5,6]

print(series3)

1    25000.0
2        NaN
3    20000.0
4        NaN
5        NaN
6        NaN
Name: State buffalo population, dtype: float64

In [44]:
print(series3.index)

Int64Index([1, 2, 3, 4, 5, 6], dtype='int64')

In [45]:
series3[2]=0

In [46]:
# To change only one value from the index values - use the rename method of the series.
series3.rename(index={3:300}, inplace = True)

print(series3)

1      25000.0
2          0.0
300    20000.0
4          NaN
5          NaN
6          NaN
Name: State buffalo population, dtype: float64

In [47]:
# The inplace parameter is False by default and only changes the row name temporarily.

series4 = series3.rename(index={300:30})

print(series3)
print(series4)
print(series3)

1      25000.0
2          0.0
300    20000.0
4          NaN
5          NaN
6          NaN
Name: State buffalo population, dtype: float64
1     25000.0
2         0.0
30    20000.0
4         NaN
5         NaN
6         NaN
Name: State buffalo population, dtype: float64
1      25000.0
2          0.0
300    20000.0
4          NaN
5          NaN
6          NaN
Name: State buffalo population, dtype: float64

In [48]:
series3[300] = 50000


print(series3)

1      25000.0
2          0.0
300    50000.0
4          NaN
5          NaN
6          NaN
Name: State buffalo population, dtype: float64

Note how in the original dataframe series3 - the index 300 was only temporarily changed to 30 and passed on to the series4 
where it was permanently stored as 30. To change the index (or column name) in the original dataframe permanently we need to set the inplace parameter to True as we saw previously.

### DataFrame
A DataFrame represents a rectangular table of data and contains an ordered collection of
columns, each of which can be a different value type (numeric, string, boolean, etc.). The
DataFrame has both a row and column index; it can be thought of as a dict of Series all sharing
the same index. Under the hood, the data is stored as one or more two-dimensional blocks
rather than a list, dict, or some other collection of one-dimensional arrays.

There are many ways to construct a DataFrame, though one of the most common is from a dict
of equal-length lists or NumPy arrays:

In [49]:
dict1 = {'State' : ['Ohio', 'Nevada', 'California','Ohio', 'Nevada', 'California'], 'Year' : [2000, 2000, 2000, 2001, 2001, 2001],\
        'pop' : [1.5, 1.7, 2.5, 1.8, 1.9, 2.8]}

pop_data = pd.DataFrame(dict1)
print(pop_data)

        State  Year  pop
0        Ohio  2000  1.5
1      Nevada  2000  1.7
2  California  2000  2.5
3        Ohio  2001  1.8
4      Nevada  2001  1.9
5  California  2001  2.8

The resulting DataFrame will have its index assigned automatically as with Series.

Another way to initialise the DataFrame :

In [50]:
dict2 = (('Ohio', 2000, 1.5), ('Nevada', 2000, 1.7), ('Nevada', 2001, 1.9), ('Ohio', 2001, 1.8), ('California', 2000, 2.5),\
        ('California', 2001, 2.8))

In [51]:
pop_data = pd.DataFrame(dict2, columns=['State', 'Year', 'pop'])
print(pop_data)

        State  Year  pop
0        Ohio  2000  1.5
1      Nevada  2000  1.7
2      Nevada  2001  1.9
3        Ohio  2001  1.8
4  California  2000  2.5
5  California  2001  2.8

In [52]:
# The head method displays only the first 5 rows of the dataframe or series. 

pop_data.head()

        State  Year  pop
0        Ohio  2000  1.5
1      Nevada  2000  1.7
2      Nevada  2001  1.9
3        Ohio  2001  1.8
4  California  2000  2.5

In [53]:
# It can take an argument for the number of rows to display. 

pop_data.head(10)

        State  Year  pop
0        Ohio  2000  1.5
1      Nevada  2000  1.7
2      Nevada  2001  1.9
3        Ohio  2001  1.8
4  California  2000  2.5
5  California  2001  2.8

Similarly, the tail method shows the last 5 rows of the dataframe(without any parameters). If size specified in the parameters, then it shows those many number of rows.

In [54]:
pop_data.tail()

        State  Year  pop
1      Nevada  2000  1.7
2      Nevada  2001  1.9
3        Ohio  2001  1.8
4  California  2000  2.5
5  California  2001  2.8

In [55]:
pop_data.tail(10)

        State  Year  pop
0        Ohio  2000  1.5
1      Nevada  2000  1.7
2      Nevada  2001  1.9
3        Ohio  2001  1.8
4  California  2000  2.5
5  California  2001  2.8

Since our dataframe only had 6 rows (less than the 10 specified in head and tail, it displayed all the rows.

The below methods in pandas can come in handy when we want to display more rows and columns of a large dataframe. Here we are specifying 20 rows to be displayed and in the second line 20 columns. We can change these values are required and if
None is specified then ALL the rows and columns will be displayed. For very large dataframes that may not be practical. 

As of now, since we are using small dataframes, these will not show their usefulness.

In [56]:
pd.set_option('display.max_rows', 20)
pd.set_option('display.max_columns', 20)

Note that they have no effect on the head function just discussed. Only while trying to display the whole dataframe with a print command or by typing the dataframe name in a cell of a notebook.

In [57]:
pop_data.rename(columns = {'pop': 'Population'}, inplace = True)
print(pop_data)

        State  Year  Population
0        Ohio  2000         1.5
1      Nevada  2000         1.7
2      Nevada  2001         1.9
3        Ohio  2001         1.8
4  California  2000         2.5
5  California  2001         2.8

In [58]:
dict1 = {'State' : ['Ohio', 'Nevada', 'California','Ohio', 'Nevada', 'California'], 'Year' : [2000, 2000, 2000, 2001, 2001, 2001],\
        'pop' : [1.5, 1.7, 2.5, 1.8, 1.9, 2.8]}

In [59]:
pop_data = pd.DataFrame(dict1,columns = ['State', 'Population', 'Year'])
print(pop_data)

        State Population  Year
0        Ohio        NaN  2000
1      Nevada        NaN  2000
2  California        NaN  2000
3        Ohio        NaN  2001
4      Nevada        NaN  2001
5  California        NaN  2001

In [60]:
pop_data = pd.DataFrame(dict1)
print(pop_data)

        State  Year  pop
0        Ohio  2000  1.5
1      Nevada  2000  1.7
2  California  2000  2.5
3        Ohio  2001  1.8
4      Nevada  2001  1.9
5  California  2001  2.8

Note how the column name in the list of column names that was not in the original dictionary ('Population) was filled with NaN values and the column name that was in the original dictionary but not in the index names ('pop') was not picked up.

In [61]:
dict1 = {'State' : ['Ohio', 'Nevada', 'California','Ohio', 'Nevada', 'California'], 'Year' : [2000, 2000, 2000, 2001, 2001, 2001],\
        'pop' : [1.5, 1.7, 2.5, 1.8, 1.9, 2.8]}

pop_data = pd.DataFrame(dict1, columns = ('State', 'pop', 'Year'))
print(pop_data)

        State  pop  Year
0        Ohio  1.5  2000
1      Nevada  1.7  2000
2  California  2.5  2000
3        Ohio  1.8  2001
4      Nevada  1.9  2001
5  California  2.8  2001

In [62]:
pop_data.columns = ['pop', 'State', 'Year']
print(pop_data)

          pop  State  Year
0        Ohio    1.5  2000
1      Nevada    1.7  2000
2  California    2.5  2000
3        Ohio    1.8  2001
4      Nevada    1.9  2001
5  California    2.8  2001

Note the change in order of column names from dictionary input order. The order specified in the tuple or list of column names is picked up.

In [63]:
pop_data = pd.DataFrame(dict1, columns = ('State', 'pop', 'Year'), index = list('abcdef'))
print(pop_data)

        State  pop  Year
a        Ohio  1.5  2000
b      Nevada  1.7  2000
c  California  2.5  2000
d        Ohio  1.8  2001
e      Nevada  1.9  2001
f  California  2.8  2001

Specifying the index names in above example.

A column in a DataFrame can be retrieved as a Series either by dict-like notation or by attribute:

In [64]:
print(pop_data['State'])

print('-'*125)

print(pop_data.State)

a          Ohio
b        Nevada
c    California
d          Ohio
e        Nevada
f    California
Name: State, dtype: object
-----------------------------------------------------------------------------------------------------------------------------
a          Ohio
b        Nevada
c    California
d          Ohio
e        Nevada
f    California
Name: State, dtype: object

As long as the name of the column follows convention for naming identifiers.

In [65]:
dict1 = {'State Name' : ['Ohio', 'Nevada', 'California','Ohio', 'Nevada', 'California'], 'Year' : [2000, 2000, 2000, 2001, 2001, 2001],\
        'pop' : [1.5, 1.7, 2.5, 1.8, 1.9, 2.8]}

pop_data = pd.DataFrame(dict1)
print(pop_data)

   State Name  Year  pop
0        Ohio  2000  1.5
1      Nevada  2000  1.7
2  California  2000  2.5
3        Ohio  2001  1.8
4      Nevada  2001  1.9
5  California  2001  2.8

In [66]:
print(pop_data['State Name'])

0          Ohio
1        Nevada
2    California
3          Ohio
4        Nevada
5    California
Name: State Name, dtype: object

In [67]:
print(pop_data.State Name)

SyntaxError: invalid syntax (<ipython-input-67-fa3e3a4c04ad>, line 1)

In [69]:
pop_data.rename(columns = {'State Name': 'State_Name'}, inplace = True)
print(pop_data)

   State_Name  Year  pop
0        Ohio  2000  1.5
1      Nevada  2000  1.7
2  California  2000  2.5
3        Ohio  2001  1.8
4      Nevada  2001  1.9
5  California  2001  2.8

In [70]:
print(pop_data.State_Name)

0          Ohio
1        Nevada
2    California
3          Ohio
4        Nevada
5    California
Name: State_Name, dtype: object

In [71]:
pop_data[['State_Name', 'Year']] #Accessing multiple columns by placing them in a list and then subscripting. Note the
# double square braces and the column 'pop' was not accessed.

   State_Name  Year
0        Ohio  2000
1      Nevada  2000
2  California  2000
3        Ohio  2001
4      Nevada  2001
5  California  2001

Rows can be access by the special .loc attribute (by name) or .iloc attribute by index number.

In [72]:
pop_data.rename(index = {0:'a', 1:'b', 2:'c', 3:'d', 4:'e', 5:'f'}, inplace = True)

print(pop_data)

   State_Name  Year  pop
a        Ohio  2000  1.5
b      Nevada  2000  1.7
c  California  2000  2.5
d        Ohio  2001  1.8
e      Nevada  2001  1.9
f  California  2001  2.8

In [73]:
# pop_data = pd.DataFrame(dict1, columns = ('State', 'pop', 'Year'), ),index = {0:'a', 1:'b', 2:'c', 3:'d', 4:'e', 5:'f'}
# print(pop_data)

In [74]:
print(pop_data.loc['b'])

State_Name    Nevada
Year            2000
pop              1.7
Name: b, dtype: object

In [75]:
print(pop_data.iloc[1])

State_Name    Nevada
Year            2000
pop              1.7
Name: b, dtype: object

In [76]:
print(pop_data.loc[['b', 'c']]) # Accessing multiple rows by placing them in a list.

   State_Name  Year  pop
b      Nevada  2000  1.7
c  California  2000  2.5

In [79]:
pop_data.iloc[1:4]

   State_Name  Year  pop
b      Nevada  2000  1.7
c  California  2000  2.5
d        Ohio  2001  1.8

Columns can be modified by assignment.

In [80]:
pop_data['pop'] = [10,20,30,40,50,60]
pop_data
print(type(pop_data))
print(type(pop_data['pop']))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

A new column also can be created by assignment i.e. if the column does not exist the column name and values get added to the dataframe.

In [81]:

print(pop_data)

   State_Name  Year  pop
a        Ohio  2000   10
b      Nevada  2000   20
c  California  2000   30
d        Ohio  2001   40
e      Nevada  2001   50
f  California  2001   60

In [82]:
pop_data['Debt'] = range(6)

pop_data

   State_Name  Year  pop  Debt
a        Ohio  2000   10     0
b      Nevada  2000   20     1
c  California  2000   30     2
d        Ohio  2001   40     3
e      Nevada  2001   50     4
f  California  2001   60     5

In [83]:
pop_data['Debt'] = 15 

pop_data

   State_Name  Year  pop  Debt
a        Ohio  2000   10    15
b      Nevada  2000   20    15
c  California  2000   30    15
d        Ohio  2001   40    15
e      Nevada  2001   50    15
f  California  2001   60    15

A single scalar value will assign the value to all the rows of that column in the dataframe.

When assigning values to the columns of a dataframe through lists or other iterables, the lengths of the values must match.

In [84]:
val = list('ABCDE')
len(val)

5

In [85]:
len(pop_data.Debt)

6

In [86]:
pop_data.Debt = val
pop_data

ValueError: Length of values does not match length of index

In [87]:
val = list('ABCDEF')

pop_data.Debt = val

pop_data

   State_Name  Year  pop Debt
a        Ohio  2000   10    A
b      Nevada  2000   20    B
c  California  2000   30    C
d        Ohio  2001   40    D
e      Nevada  2001   50    E
f  California  2001   60    F

As we see, an iterable with the correct length was stored in the dataframe. Also, that the .column_name attribute could be
used for assignment also(along with retrieval that we saw earlier). However, .column_name attribute cannot be used for creation of new column name which subscripton ['Column_Name'] can be used for creation of column names and assignment of values in one go. More on that later.

However, if you assign a series to a column in a dataframe, the labels will be matched and the unavailable values will be 
filled with NaN.

In [88]:
tax_r = pd.Series({'a':12, 'b':22, 'C': 18})

print(type(tax_r))

<class 'pandas.core.series.Series'>

In [89]:
pop_data['Tax_Rate'] = tax_r

pop_data

   State_Name  Year  pop Debt  Tax_Rate
a        Ohio  2000   10    A      12.0
b      Nevada  2000   20    B      22.0
c  California  2000   30    C       NaN
d        Ohio  2001   40    D       NaN
e      Nevada  2001   50    E       NaN
f  California  2001   60    F       NaN

Note how the label 'C' <capital> from the series which was not found in the dataframe was not added to the dataframe and the labels 'c','d','e' & 'f' not found in the series were filled with NaN values in the Dataframe.

Creation of a column name based on conditions.

In [90]:
pop_data['Eastern'] = pop_data.State_Name == 'Ohio'

pop_data

   State_Name  Year  pop Debt  Tax_Rate  Eastern
a        Ohio  2000   10    A      12.0     True
b      Nevada  2000   20    B      22.0    False
c  California  2000   30    C       NaN    False
d        Ohio  2001   40    D       NaN     True
e      Nevada  2001   50    E       NaN    False
f  California  2001   60    F       NaN    False

We can use the del keyword to delete a column of a dataframe

In [91]:
del pop_data['Eastern']

In [92]:
pop_data

   State_Name  Year  pop Debt  Tax_Rate
a        Ohio  2000   10    A      12.0
b      Nevada  2000   20    B      22.0
c  California  2000   30    C       NaN
d        Ohio  2001   40    D       NaN
e      Nevada  2001   50    E       NaN
f  California  2001   60    F       NaN

In [93]:
pop_data_xtract = pop_data['Tax_Rate']

pop_data_xtract
print(pop_data_xtract)
print(type(pop_data_xtract))

a    12.0
b    22.0
c     NaN
d     NaN
e     NaN
f     NaN
Name: Tax_Rate, dtype: float64
<class 'pandas.core.series.Series'>

In [94]:
print(type(pop_data_xtract))

<class 'pandas.core.series.Series'>

In [95]:
pop_data_xtract.fillna(18, inplace = True)

In [96]:
pop_data_xtract

a    12.0
b    22.0
c    18.0
d    18.0
e    18.0
f    18.0
Name: Tax_Rate, dtype: float64

In [97]:
pop_data

   State_Name  Year  pop Debt  Tax_Rate
a        Ohio  2000   10    A      12.0
b      Nevada  2000   20    B      22.0
c  California  2000   30    C      18.0
d        Ohio  2001   40    D      18.0
e      Nevada  2001   50    E      18.0
f  California  2001   60    F      18.0

Note how a change to the extracted Series from the dataframe affected the original dataframe. That is because the extracted
series is only a view object on the original dataframe. To create an explicit copy, use a series copy method.

In [98]:
pop_data_xtract = pop_data['Tax_Rate'].copy() #Note here that unlike the copy module in Python, here copy (with default 
# Deep as True is a Pandas instance method. Setting Deep to False will make a shallow copy just like extracting the series
# from DataFrame)

In [99]:
pop_data_xtract

a    12.0
b    22.0
c    18.0
d    18.0
e    18.0
f    18.0
Name: Tax_Rate, dtype: float64

In [100]:
pop_data_xtract.loc['c'] = 32

pop_data_xtract

a    12.0
b    22.0
c    32.0
d    18.0
e    18.0
f    18.0
Name: Tax_Rate, dtype: float64

In [101]:
pop_data

   State_Name  Year  pop Debt  Tax_Rate
a        Ohio  2000   10    A      12.0
b      Nevada  2000   20    B      22.0
c  California  2000   30    C      18.0
d        Ohio  2001   40    D      18.0
e      Nevada  2001   50    E      18.0
f  California  2001   60    F      18.0

Another common form of data is a nested dict of dicts.

If the nested dict is passed to the DataFrame, pandas will interpret the outer dict keys as the
columns and the inner keys as the row indices:

In [ ]:
dict1 = {'Nevada' : {2000 : 1.7, 2001 :1.9}, 'Ohio' : {2020 : 1.5, 2021 :1.8}, 'California' : {2000 : 2.5, 2001 :2.9}}

In [102]:
pop_data = pd.DataFrame(dict1)
pop_data

   State Name  Year  pop
0        Ohio  2000  1.5
1      Nevada  2000  1.7
2  California  2000  2.5
3        Ohio  2001  1.8
4      Nevada  2001  1.9
5  California  2001  2.8

In [103]:
dict2 = {'State' : {'a' : 'Ohio', 'b' : 'Nevada', 'c':'California', 'd' : 'Ohio', 'e' : 'Nevada', 'f':'California'},\
'Year' : {'a' : 2000, 'b' : 2000, 'c':2000, 'd' : 2001, 'e' : 2001, 'f': 2001 }, 'pop' : {'a' : 10, 'b' : 20, 'c':30,\
'd' : 40, 'e' : 50, 'f':60},'Debt' : {'a' : 'A', 'b' : 'B', 'c':'C', 'd' : 'D', 'e' : 'E', 'f':'F'},\
'Tax_Rate' : {'a' : 12, 'b' : 22, 'c':18, 'd' : 18, 'e' : 18, 'f':18}}

In [104]:
pop_data = pd.DataFrame(dict2)
pop_data

        State  Year  pop Debt  Tax_Rate
a        Ohio  2000   10    A        12
b      Nevada  2000   20    B        22
c  California  2000   30    C        18
d        Ohio  2001   40    D        18
e      Nevada  2001   50    E        18
f  California  2001   60    F        18

One can transpose the dataframe(swap rows and columns) with numpy like syntax (but since there are only two axis here, it is much easier to visualise.

In [105]:
pop_data_T = pop_data.transpose()
pop_data_T

             a       b           c     d       e           f
State     Ohio  Nevada  California  Ohio  Nevada  California
Year      2000    2000        2000  2001    2001        2001
pop         10      20          30    40      50          60
Debt         A       B           C     D       E           F
Tax_Rate    12      22          18    18      18          18

In [106]:
pop_data

        State  Year  pop Debt  Tax_Rate
a        Ohio  2000   10    A        12
b      Nevada  2000   20    B        22
c  California  2000   30    C        18
d        Ohio  2001   40    D        18
e      Nevada  2001   50    E        18
f  California  2001   60    F        18

In [112]:
pop_data_T['a'].loc['State'] = 'New York State'

pop_data_T

                       a       b           c     d       e           f
State     New York State  Nevada  California  Ohio  Nevada  California
Year                2000    2000        2000  2001    2001        2001
pop                   10      20          30    40      50          60
Debt                   A       B           C     D       E           F
Tax_Rate              12      22          18    18      18          18

In [113]:
pop_data_T

                       a       b           c     d       e           f
State     New York State  Nevada  California  Ohio  Nevada  California
Year                2000    2000        2000  2001    2001        2001
pop                   10      20          30    40      50          60
Debt                   A       B           C     D       E           F
Tax_Rate              12      22          18    18      18          18

In [108]:
pop_data

        State  Year  pop Debt  Tax_Rate
a        Ohio  2000   10    A        12
b      Nevada  2000   20    B        22
c  California  2000   30    C        18
d        Ohio  2001   40    D        18
e      Nevada  2001   50    E        18
f  California  2001   60    F        18

In [114]:
pop_data.index.name = 'Alphas'
pop_data.columns.name = 'Cols'

print(pop_data[pop_data['Tax_Rate'] == 18])

Cols         State  Year  pop Debt  Tax_Rate
Alphas
c       California  2000   30    C        18
d             Ohio  2001   40    D        18
e           Nevada  2001   50    E        18
f       California  2001   60    F        18

The index and column names can be specified with the above methods.

The values attribute returns the values in the dataframe as two dimensional arrays with each array on axis 1 being the row values.

In [115]:
pop_data

Cols         State  Year  pop Debt  Tax_Rate
Alphas
a             Ohio  2000   10    A        12
b           Nevada  2000   20    B        22
c       California  2000   30    C        18
d             Ohio  2001   40    D        18
e           Nevada  2001   50    E        18
f       California  2001   60    F        18

In [116]:
pop_data.values

array([['Ohio', 2000, 10, 'A', 12],
       ['Nevada', 2000, 20, 'B', 22],
       ['California', 2000, 30, 'C', 18],
       ['Ohio', 2001, 40, 'D', 18],
       ['Nevada', 2001, 50, 'E', 18],
       ['California', 2001, 60, 'F', 18]], dtype=object)

As we note, the dtype is displayed to accomodate all the datatypes in the dataframe. When there are mixed datatypes, they
are considered 'object' type.

### Index Objects

Pandas’s Index objects are responsible for holding the axis labels and other metadata (like the
axis name or names). Any array or other sequence of labels you use when constructing a
Series or DataFrame is internally converted to an Index:

In [117]:
import pandas as pd

series1 = pd.Series(list('abcdefghij'), index = list(range(10)))

print(series1)

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
8    i
9    j
dtype: object

In [118]:
print(series1.index)
print(type(series1.index))

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')
<class 'pandas.core.indexes.numeric.Int64Index'>

In [119]:
# There are many methods for the index object in Pandas which can be viewed by:

# print(dir(<series_dataframe_instance>.index))

print(dir(series1.index))

['T', '__abs__', '__add__', '__and__', '__annotations__', '__array__', '__array_priority__', '__array_wrap__', '__bool__', '__class__', '__contains__', '__copy__', '__deepcopy__', '__delattr__', '__dict__', '__dir__', '__divmod__', '__doc__', '__eq__', '__floordiv__', '__format__', '__ge__', '__getattribute__', '__getitem__', '__gt__', '__hash__', '__iadd__', '__init__', '__init_subclass__', '__inv__', '__iter__', '__le__', '__len__', '__lt__', '__mod__', '__module__', '__mul__', '__ne__', '__neg__', '__new__', '__nonzero__', '__or__', '__pos__', '__pow__', '__radd__', '__reduce__', '__reduce_ex__', '__repr__', '__rfloordiv__', '__rmul__', '__rpow__', '__rsub__', '__rtruediv__', '__setattr__', '__setitem__', '__sizeof__', '__str__', '__sub__', '__subclasshook__', '__truediv__', '__weakref__', '__xor__', '_accessors', '_add_comparison_methods', '_add_logical_methods', '_add_logical_methods_disabled', '_add_numeric_methods', '_add_numeric_methods_add_sub_disabled', '_add_numeric_methods_binary', '_add_numeric_methods_disabled', '_add_numeric_methods_unary', '_assert_can_do_op', '_assert_can_do_setop', '_assert_safe_casting', '_assert_take_fillable', '_attributes', '_can_hold_identifiers_and_holds_name', '_can_hold_na', '_can_reindex', '_cleanup', '_coerce_scalar_to_index', '_comparables', '_concat', '_concat_same_dtype', '_constructor', '_convert_arr_indexer', '_convert_can_do_setop', '_convert_for_op', '_convert_index_indexer', '_convert_list_indexer', '_convert_listlike_indexer', '_convert_scalar_indexer', '_convert_slice_indexer', '_convert_tolerance', '_default_dtype', '_defer_to_indexing', '_deprecations', '_dir_additions', '_dir_deletions', '_engine', '_engine_type', '_filter_indexer_tolerance', '_format_attrs', '_format_data', '_format_native_types', '_format_space', '_format_with_header', '_formatter_func', '_get_attributes_dict', '_get_fill_indexer', '_get_fill_indexer_searchsorted', '_get_grouper_for_level', '_get_level_number', '_get_level_values', '_get_names', '_get_nearest_indexer', '_get_reconciled_name_object', '_get_string_slice', '_get_unique_index', '_has_complex_internals', '_id', '_infer_as_myclass', '_inner_indexer', '_internal_get_values', '_invalid_indexer', '_is_compatible_with_other', '_is_memory_usage_qualified', '_is_numeric_dtype', '_is_strictly_monotonic_decreasing', '_is_strictly_monotonic_increasing', '_isnan', '_join_level', '_join_monotonic', '_join_multi', '_join_non_unique', '_join_precedence', '_left_indexer', '_left_indexer_unique', '_map_values', '_maybe_cast_indexer', '_maybe_cast_slice_bound', '_maybe_promote', '_mpl_repr', '_na_value', '_name', '_nan_idxs', '_ndarray_values', '_no_setting_name', '_outer_indexer', '_reduce', '_reindex_non_unique', '_reset_cache', '_reset_identity', '_scalar_data_error', '_searchsorted_monotonic', '_set_names', '_shallow_copy', '_shallow_copy_with_infer', '_simple_new', '_sort_levels_monotonic', '_string_data_error', '_summary', '_supports_partial_string_indexing', '_to_safe_for_reshape', '_typ', '_union', '_union_incompatible_dtypes', '_update_inplace', '_validate_dtype', '_validate_index_level', '_validate_indexer', '_validate_names', '_validate_sort_keyword', '_values', '_wrap_joined_index', '_wrap_setop_result', 'all', 'any', 'append', 'argmax', 'argmin', 'argsort', 'array', 'asi8', 'asof', 'asof_locs', 'astype', 'copy', 'delete', 'difference', 'drop', 'drop_duplicates', 'droplevel', 'dropna', 'dtype', 'duplicated', 'empty', 'equals', 'factorize', 'fillna', 'format', 'get_indexer', 'get_indexer_for', 'get_indexer_non_unique', 'get_level_values', 'get_loc', 'get_slice_bound', 'get_value', 'groupby', 'has_duplicates', 'hasnans', 'holds_integer', 'identical', 'inferred_type', 'insert', 'intersection', 'is_', 'is_all_dates', 'is_boolean', 'is_categorical', 'is_floating', 'is_integer', 'is_interval', 'is_mixed', 'is_monotonic', 'is_monotonic_decreasing', 'is_monotonic_increasing', 'is_numeric', 'is_object', 'is_type_compatible', 'is_unique', 'isin', 'isna', 'isnull', 'item', 'join', 'map', 'max', 'memory_usage', 'min', 'name', 'names', 'nbytes', 'ndim', 'nlevels', 'notna', 'notnull', 'nunique', 'putmask', 'ravel', 'reindex', 'rename', 'repeat', 'searchsorted', 'set_names', 'shape', 'shift', 'size', 'slice_indexer', 'slice_locs', 'sort', 'sort_values', 'sortlevel', 'symmetric_difference', 'take', 'to_flat_index', 'to_frame', 'to_list', 'to_native_types', 'to_numpy', 'to_series', 'transpose', 'union', 'unique', 'value_counts', 'values', 'view', 'where']

In [ ]:
# However, these methods can mostly be used to get a new index object. This new index object(unless of the same length as 
# original index cannot be assigned to the original dataframe or series). Thus they are of limited use and do not require
# too much deliberation

In [120]:
series = pd.Series(list(range(0,100, 10)), index = list(range(10)))
series1 = pd.Series(list(range(100,200,10)), index = list(range(10,20)))

In [121]:
print(series)

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [122]:
print(series1)

10    100
11    110
12    120
13    130
14    140
15    150
16    160
17    170
18    180
19    190
dtype: int64

In [123]:
series.index.append(series1.index)

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18,
            19],
           dtype='int64')

Note how the return is an index object

In [124]:
x = series.index.append(series1.index)
print(x)

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18,
            19],
           dtype='int64')

In [125]:
series.index = x

ValueError: Length mismatch: Expected axis has 10 elements, new values have 20 elements

In [126]:
series3 = pd.Series(list(range(10)), index = x)

print(series3)

ValueError: Length of passed values is 10, index implies 20.

In [ ]:
# Essential functionality in Pandas.

#### reindexing

An important method on pandas objects is reindex, which means to create a new object with the
data conformed to a new index.

In [127]:
series = pd.Series(list(range(0,100,10)), index = list(range(10)))
print(series)

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [128]:
series = series.reindex(list(range(11)))
print(series)

0      0.0
1     10.0
2     20.0
3     30.0
4     40.0
5     50.0
6     60.0
7     70.0
8     80.0
9     90.0
10     NaN
dtype: float64

Note that this does not alter the original series or dataframe. It returns a new series/df with reindex performed. Therefore, the returned object must be assigned, either to the original variable or to a new variable.

Also, any missing values for available labels will be filled with NaN.

In [129]:
series2 = pd.Series(['a','b','c'], index = [0,4,8])
print(series2)

0    a
4    b
8    c
dtype: object

The 'method' parameter while reindexing can take the following options:

None - No fill. Default
'backfill' or 'bfill' - Take the value of the next succeeding value
'pad'/'ffill' - Take the value of previous value
'nearest' - Take the nearest value.

limit parameter - limits the maximum number of consecutive elements allowed to ffill or bfill

In [130]:
series3 = series2.reindex(list(range(10)))
print(series3)

0      a
1    NaN
2    NaN
3    NaN
4      b
5    NaN
6    NaN
7    NaN
8      c
9    NaN
dtype: object

In [131]:
print(series2)

0    a
4    b
8    c
dtype: object

In [132]:
series4 = series2.reindex(list(range(10)), method = 'ffill')
print(series4)

0    a
1    a
2    a
3    a
4    b
5    b
6    b
7    b
8    c
9    c
dtype: object

In [133]:
series5 = series2.reindex(list(range(10)), method = 'bfill')
print(series5)

0      a
1      b
2      b
3      b
4      b
5      c
6      c
7      c
8      c
9    NaN
dtype: object

In [134]:
series6 = series2.reindex(list(range(10)), method = 'nearest')
print(series6)

0    a
1    a
2    b
3    b
4    b
5    b
6    c
7    c
8    c
9    c
dtype: object

In [135]:
series7 = series2.reindex(list(range(10)), method = 'bfill', limit = 2)
print(series7)

0      a
1    NaN
2      b
3      b
4      b
5    NaN
6      c
7      c
8      c
9    NaN
dtype: object

With DataFrame, reindex can alter either the (row) index, columns, or both. When passed only a
sequence, it defaults to reindexes the rows in the result

In [136]:
dict2 = {'State' : {1 : 'Ohio', 2 : 'Nevada', 3:'California', 4 : 'Ohio', 5 : 'Nevada', 6:'California'},\
'Year' : {1 : 2000, 2 : 2000, 3:2000, 4 : 2001, 5 : 2001, 6: 2001 }, 'pop' : {1 : 10, 2 : 20, 3:30,\
4 : 40, 5 : 50, 6:60},'Debt' : {1 : 'A', 2 : 'B', 3:'C', 4 : 'D', 5 : 'E', 6:'F'},\
'Tax_Rate' : {1 : 12, 2 : 22, 3:18, 4 : 18, 5 : 18, 6:18}}

In [137]:
pop_data = pd.DataFrame(dict2)
pop_data

        State  Year  pop Debt  Tax_Rate
1        Ohio  2000   10    A        12
2      Nevada  2000   20    B        22
3  California  2000   30    C        18
4        Ohio  2001   40    D        18
5      Nevada  2001   50    E        18
6  California  2001   60    F        18

In [138]:
pop_data = pop_data.reindex(list(range(10)))
pop_data

        State    Year   pop Debt  Tax_Rate
0         NaN     NaN   NaN  NaN       NaN
1        Ohio  2000.0  10.0    A      12.0
2      Nevada  2000.0  20.0    B      22.0
3  California  2000.0  30.0    C      18.0
4        Ohio  2001.0  40.0    D      18.0
5      Nevada  2001.0  50.0    E      18.0
6  California  2001.0  60.0    F      18.0
7         NaN     NaN   NaN  NaN       NaN
8         NaN     NaN   NaN  NaN       NaN
9         NaN     NaN   NaN  NaN       NaN

With the keyword 'columns' specified - it reindexes the columns.

In [139]:
pop_data = pop_data.reindex(columns = ['Year', 'Debt', 'Tax_Rate','State', 'Fed Tax Rate', 'Population'])
pop_data

     Year Debt  Tax_Rate       State  Fed Tax Rate  Population
0     NaN  NaN       NaN         NaN           NaN         NaN
1  2000.0    A      12.0        Ohio           NaN         NaN
2  2000.0    B      22.0      Nevada           NaN         NaN
3  2000.0    C      18.0  California           NaN         NaN
4  2001.0    D      18.0        Ohio           NaN         NaN
5  2001.0    E      18.0      Nevada           NaN         NaN
6  2001.0    F      18.0  California           NaN         NaN
7     NaN  NaN       NaN         NaN           NaN         NaN
8     NaN  NaN       NaN         NaN           NaN         NaN
9     NaN  NaN       NaN         NaN           NaN         NaN

Drop method drops the entries from the specified axis. It defaults to dropping from rows or axis = 0

In Pandas the axes are fixed - rows = axis 0, columns = axis 1

In [140]:
pop_data.drop(7)

     Year Debt  Tax_Rate       State  Fed Tax Rate  Population
0     NaN  NaN       NaN         NaN           NaN         NaN
1  2000.0    A      12.0        Ohio           NaN         NaN
2  2000.0    B      22.0      Nevada           NaN         NaN
3  2000.0    C      18.0  California           NaN         NaN
4  2001.0    D      18.0        Ohio           NaN         NaN
5  2001.0    E      18.0      Nevada           NaN         NaN
6  2001.0    F      18.0  California           NaN         NaN
8     NaN  NaN       NaN         NaN           NaN         NaN
9     NaN  NaN       NaN         NaN           NaN         NaN

In [141]:
pop_data

     Year Debt  Tax_Rate       State  Fed Tax Rate  Population
0     NaN  NaN       NaN         NaN           NaN         NaN
1  2000.0    A      12.0        Ohio           NaN         NaN
2  2000.0    B      22.0      Nevada           NaN         NaN
3  2000.0    C      18.0  California           NaN         NaN
4  2001.0    D      18.0        Ohio           NaN         NaN
5  2001.0    E      18.0      Nevada           NaN         NaN
6  2001.0    F      18.0  California           NaN         NaN
7     NaN  NaN       NaN         NaN           NaN         NaN
8     NaN  NaN       NaN         NaN           NaN         NaN
9     NaN  NaN       NaN         NaN           NaN         NaN

It returns a new dataframe after removing the specified entries without modifying the original dataframe unless inplace is set to True. So, if we wish to preserve the original dataframe, save the new df object to a new variable.

In [142]:
pop_data1 = pop_data.drop(7)

In [143]:
pop_data1

     Year Debt  Tax_Rate       State  Fed Tax Rate  Population
0     NaN  NaN       NaN         NaN           NaN         NaN
1  2000.0    A      12.0        Ohio           NaN         NaN
2  2000.0    B      22.0      Nevada           NaN         NaN
3  2000.0    C      18.0  California           NaN         NaN
4  2001.0    D      18.0        Ohio           NaN         NaN
5  2001.0    E      18.0      Nevada           NaN         NaN
6  2001.0    F      18.0  California           NaN         NaN
8     NaN  NaN       NaN         NaN           NaN         NaN
9     NaN  NaN       NaN         NaN           NaN         NaN

In [144]:
pop_data

     Year Debt  Tax_Rate       State  Fed Tax Rate  Population
0     NaN  NaN       NaN         NaN           NaN         NaN
1  2000.0    A      12.0        Ohio           NaN         NaN
2  2000.0    B      22.0      Nevada           NaN         NaN
3  2000.0    C      18.0  California           NaN         NaN
4  2001.0    D      18.0        Ohio           NaN         NaN
5  2001.0    E      18.0      Nevada           NaN         NaN
6  2001.0    F      18.0  California           NaN         NaN
7     NaN  NaN       NaN         NaN           NaN         NaN
8     NaN  NaN       NaN         NaN           NaN         NaN
9     NaN  NaN       NaN         NaN           NaN         NaN

In [145]:
pop_data.drop(7, inplace = True)

In [146]:
pop_data

     Year Debt  Tax_Rate       State  Fed Tax Rate  Population
0     NaN  NaN       NaN         NaN           NaN         NaN
1  2000.0    A      12.0        Ohio           NaN         NaN
2  2000.0    B      22.0      Nevada           NaN         NaN
3  2000.0    C      18.0  California           NaN         NaN
4  2001.0    D      18.0        Ohio           NaN         NaN
5  2001.0    E      18.0      Nevada           NaN         NaN
6  2001.0    F      18.0  California           NaN         NaN
8     NaN  NaN       NaN         NaN           NaN         NaN
9     NaN  NaN       NaN         NaN           NaN         NaN

In [147]:
pop_data = pop_data.reindex(list(range(10)))
pop_data

     Year Debt  Tax_Rate       State  Fed Tax Rate  Population
0     NaN  NaN       NaN         NaN           NaN         NaN
1  2000.0    A      12.0        Ohio           NaN         NaN
2  2000.0    B      22.0      Nevada           NaN         NaN
3  2000.0    C      18.0  California           NaN         NaN
4  2001.0    D      18.0        Ohio           NaN         NaN
5  2001.0    E      18.0      Nevada           NaN         NaN
6  2001.0    F      18.0  California           NaN         NaN
7     NaN  NaN       NaN         NaN           NaN         NaN
8     NaN  NaN       NaN         NaN           NaN         NaN
9     NaN  NaN       NaN         NaN           NaN         NaN

In [148]:
pop_data.drop(7, axis = 'rows')

     Year Debt  Tax_Rate       State  Fed Tax Rate  Population
0     NaN  NaN       NaN         NaN           NaN         NaN
1  2000.0    A      12.0        Ohio           NaN         NaN
2  2000.0    B      22.0      Nevada           NaN         NaN
3  2000.0    C      18.0  California           NaN         NaN
4  2001.0    D      18.0        Ohio           NaN         NaN
5  2001.0    E      18.0      Nevada           NaN         NaN
6  2001.0    F      18.0  California           NaN         NaN
8     NaN  NaN       NaN         NaN           NaN         NaN
9     NaN  NaN       NaN         NaN           NaN         NaN

In [149]:
pop_data.drop(7, axis = 0)

     Year Debt  Tax_Rate       State  Fed Tax Rate  Population
0     NaN  NaN       NaN         NaN           NaN         NaN
1  2000.0    A      12.0        Ohio           NaN         NaN
2  2000.0    B      22.0      Nevada           NaN         NaN
3  2000.0    C      18.0  California           NaN         NaN
4  2001.0    D      18.0        Ohio           NaN         NaN
5  2001.0    E      18.0      Nevada           NaN         NaN
6  2001.0    F      18.0  California           NaN         NaN
8     NaN  NaN       NaN         NaN           NaN         NaN
9     NaN  NaN       NaN         NaN           NaN         NaN

In [150]:
pop_data = pop_data.reindex(list(range(10)))
pop_data

     Year Debt  Tax_Rate       State  Fed Tax Rate  Population
0     NaN  NaN       NaN         NaN           NaN         NaN
1  2000.0    A      12.0        Ohio           NaN         NaN
2  2000.0    B      22.0      Nevada           NaN         NaN
3  2000.0    C      18.0  California           NaN         NaN
4  2001.0    D      18.0        Ohio           NaN         NaN
5  2001.0    E      18.0      Nevada           NaN         NaN
6  2001.0    F      18.0  California           NaN         NaN
7     NaN  NaN       NaN         NaN           NaN         NaN
8     NaN  NaN       NaN         NaN           NaN         NaN
9     NaN  NaN       NaN         NaN           NaN         NaN

In [151]:
pop_data.drop(7, axis = 0)

     Year Debt  Tax_Rate       State  Fed Tax Rate  Population
0     NaN  NaN       NaN         NaN           NaN         NaN
1  2000.0    A      12.0        Ohio           NaN         NaN
2  2000.0    B      22.0      Nevada           NaN         NaN
3  2000.0    C      18.0  California           NaN         NaN
4  2001.0    D      18.0        Ohio           NaN         NaN
5  2001.0    E      18.0      Nevada           NaN         NaN
6  2001.0    F      18.0  California           NaN         NaN
8     NaN  NaN       NaN         NaN           NaN         NaN
9     NaN  NaN       NaN         NaN           NaN         NaN

In [153]:
pop_data_col = pop_data.drop('Population', axis = 1)
pop_data_col

     Year Debt  Tax_Rate       State  Fed Tax Rate
0     NaN  NaN       NaN         NaN           NaN
1  2000.0    A      12.0        Ohio           NaN
2  2000.0    B      22.0      Nevada           NaN
3  2000.0    C      18.0  California           NaN
4  2001.0    D      18.0        Ohio           NaN
5  2001.0    E      18.0      Nevada           NaN
6  2001.0    F      18.0  California           NaN
7     NaN  NaN       NaN         NaN           NaN
8     NaN  NaN       NaN         NaN           NaN
9     NaN  NaN       NaN         NaN           NaN

In [152]:
pop_data_col = pop_data.drop('Population', axis = 'columns')
pop_data_col

     Year Debt  Tax_Rate       State  Fed Tax Rate
0     NaN  NaN       NaN         NaN           NaN
1  2000.0    A      12.0        Ohio           NaN
2  2000.0    B      22.0      Nevada           NaN
3  2000.0    C      18.0  California           NaN
4  2001.0    D      18.0        Ohio           NaN
5  2001.0    E      18.0      Nevada           NaN
6  2001.0    F      18.0  California           NaN
7     NaN  NaN       NaN         NaN           NaN
8     NaN  NaN       NaN         NaN           NaN
9     NaN  NaN       NaN         NaN           NaN

In [154]:
pop_data_col2 = pop_data.drop('Debt', axis = 1)
pop_data_col2

     Year  Tax_Rate       State  Fed Tax Rate  Population
0     NaN       NaN         NaN           NaN         NaN
1  2000.0      12.0        Ohio           NaN         NaN
2  2000.0      22.0      Nevada           NaN         NaN
3  2000.0      18.0  California           NaN         NaN
4  2001.0      18.0        Ohio           NaN         NaN
5  2001.0      18.0      Nevada           NaN         NaN
6  2001.0      18.0  California           NaN         NaN
7     NaN       NaN         NaN           NaN         NaN
8     NaN       NaN         NaN           NaN         NaN
9     NaN       NaN         NaN           NaN         NaN

In [155]:
pop_data.drop('Fed Tax Rate', inplace = True, axis = 1)
pop_data

     Year Debt  Tax_Rate       State  Population
0     NaN  NaN       NaN         NaN         NaN
1  2000.0    A      12.0        Ohio         NaN
2  2000.0    B      22.0      Nevada         NaN
3  2000.0    C      18.0  California         NaN
4  2001.0    D      18.0        Ohio         NaN
5  2001.0    E      18.0      Nevada         NaN
6  2001.0    F      18.0  California         NaN
7     NaN  NaN       NaN         NaN         NaN
8     NaN  NaN       NaN         NaN         NaN
9     NaN  NaN       NaN         NaN         NaN

In [156]:
dict2 = {'State' : {1 : 'Ohio', 2 : 'Nevada', 3:'California', 4 : 'Ohio', 5 : 'Nevada', 6:'California'},\
'Year' : {1 : 2000, 2 : 2000, 3:2000, 4 : 2001, 5 : 2001, 6: 2001 }, 'pop' : {1 : 10, 2 : 20, 3:30,\
4 : 40, 5 : 50, 6:60},'Debt' : {1 : 'A', 2 : 'B', 3:'C', 4 : 'D', 5 : 'E', 6:'F'},\
'Tax_Rate' : {1 : 12, 2 : 22, 3:18, 4 : 18, 5 : 18, 6:18}}

In [157]:
pop_data = pd.DataFrame(dict2)
pop_data

        State  Year  pop Debt  Tax_Rate
1        Ohio  2000   10    A        12
2      Nevada  2000   20    B        22
3  California  2000   30    C        18
4        Ohio  2001   40    D        18
5      Nevada  2001   50    E        18
6  California  2001   60    F        18

In [158]:
pop_data = pop_data.reindex(list(range(10)))
pop_data

        State    Year   pop Debt  Tax_Rate
0         NaN     NaN   NaN  NaN       NaN
1        Ohio  2000.0  10.0    A      12.0
2      Nevada  2000.0  20.0    B      22.0
3  California  2000.0  30.0    C      18.0
4        Ohio  2001.0  40.0    D      18.0
5      Nevada  2001.0  50.0    E      18.0
6  California  2001.0  60.0    F      18.0
7         NaN     NaN   NaN  NaN       NaN
8         NaN     NaN   NaN  NaN       NaN
9         NaN     NaN   NaN  NaN       NaN

In [159]:
pop_data = pop_data.reindex(columns = ['Year', 'Debt', 'Tax_Rate','State', 'Fed Tax Rate', 'Population'])
pop_data

     Year Debt  Tax_Rate       State  Fed Tax Rate  Population
0     NaN  NaN       NaN         NaN           NaN         NaN
1  2000.0    A      12.0        Ohio           NaN         NaN
2  2000.0    B      22.0      Nevada           NaN         NaN
3  2000.0    C      18.0  California           NaN         NaN
4  2001.0    D      18.0        Ohio           NaN         NaN
5  2001.0    E      18.0      Nevada           NaN         NaN
6  2001.0    F      18.0  California           NaN         NaN
7     NaN  NaN       NaN         NaN           NaN         NaN
8     NaN  NaN       NaN         NaN           NaN         NaN
9     NaN  NaN       NaN         NaN           NaN         NaN

With a list(in documentation is says list-like), we can remove multiple entries at a time. Tuples are treated as single objects and not accepted for multi-indexing operations.

In [160]:
pop_data.dropna(inplace = True, how = 'all', axis = 1)
pop_data

     Year Debt  Tax_Rate       State
0     NaN  NaN       NaN         NaN
1  2000.0    A      12.0        Ohio
2  2000.0    B      22.0      Nevada
3  2000.0    C      18.0  California
4  2001.0    D      18.0        Ohio
5  2001.0    E      18.0      Nevada
6  2001.0    F      18.0  California
7     NaN  NaN       NaN         NaN
8     NaN  NaN       NaN         NaN
9     NaN  NaN       NaN         NaN

In [161]:
pop_data.dropna(inplace = True, how = 'all', axis = 0)
pop_data

     Year Debt  Tax_Rate       State
1  2000.0    A      12.0        Ohio
2  2000.0    B      22.0      Nevada
3  2000.0    C      18.0  California
4  2001.0    D      18.0        Ohio
5  2001.0    E      18.0      Nevada
6  2001.0    F      18.0  California

In [162]:
pop_data.drop([0,7,8,9], inplace = True)
pop_data

KeyError: '[0 7 8 9] not found in axis'

In [163]:
pop_data.drop(['Fed Tax Rate', 'Population'], axis = 'columns', inplace = True)
pop_data

KeyError: "['Fed Tax Rate' 'Population'] not found in axis"

Adding a series to a DataFrame

In [164]:
pop_data_pop = pd.Series([1.7,1.9,2.5,1.9, 2.0, 2.9], index = list(range(1,7)))
pop_data_pop

1    1.7
2    1.9
3    2.5
4    1.9
5    2.0
6    2.9
dtype: float64

In [165]:
print(dir(pop_data))

['Debt', 'State', 'T', 'Tax_Rate', 'Year', '_AXIS_ALIASES', '_AXIS_IALIASES', '_AXIS_LEN', '_AXIS_NAMES', '_AXIS_NUMBERS', '_AXIS_ORDERS', '_AXIS_REVERSED', '__abs__', '__add__', '__and__', '__annotations__', '__array__', '__array_priority__', '__array_wrap__', '__bool__', '__class__', '__contains__', '__copy__', '__deepcopy__', '__delattr__', '__delitem__', '__dict__', '__dir__', '__div__', '__doc__', '__eq__', '__finalize__', '__floordiv__', '__format__', '__ge__', '__getattr__', '__getattribute__', '__getitem__', '__getstate__', '__gt__', '__hash__', '__iadd__', '__iand__', '__ifloordiv__', '__imod__', '__imul__', '__init__', '__init_subclass__', '__invert__', '__ior__', '__ipow__', '__isub__', '__iter__', '__itruediv__', '__ixor__', '__le__', '__len__', '__lt__', '__matmul__', '__mod__', '__module__', '__mul__', '__ne__', '__neg__', '__new__', '__nonzero__', '__or__', '__pos__', '__pow__', '__radd__', '__rand__', '__rdiv__', '__reduce__', '__reduce_ex__', '__repr__', '__rfloordiv__', '__rmatmul__', '__rmod__', '__rmul__', '__ror__', '__round__', '__rpow__', '__rsub__', '__rtruediv__', '__rxor__', '__setattr__', '__setitem__', '__setstate__', '__sizeof__', '__str__', '__sub__', '__subclasshook__', '__truediv__', '__weakref__', '__xor__', '_accessors', '_add_numeric_operations', '_add_series_or_dataframe_operations', '_agg_by_level', '_agg_examples_doc', '_agg_summary_and_see_also_doc', '_aggregate', '_aggregate_multiple_funcs', '_align_frame', '_align_series', '_box_col_values', '_box_item_values', '_builtin_table', '_check_inplace_setting', '_check_is_chained_assignment_possible', '_check_label_or_level_ambiguity', '_check_setitem_copy', '_clear_item_cache', '_clip_with_one_bound', '_clip_with_scalar', '_combine_frame', '_combine_match_index', '_consolidate', '_consolidate_inplace', '_construct_axes_dict', '_construct_axes_dict_from', '_construct_axes_from_arguments', '_construct_result', '_constructor', '_constructor_expanddim', '_constructor_sliced', '_convert', '_count_level', '_create_indexer', '_cython_table', '_deprecations', '_dir_additions', '_dir_deletions', '_drop_axis', '_drop_labels_or_levels', '_ensure_valid_index', '_find_valid_index', '_from_arrays', '_from_axes', '_get_agg_axis', '_get_axis', '_get_axis_name', '_get_axis_number', '_get_axis_resolvers', '_get_block_manager_axis', '_get_bool_data', '_get_cacher', '_get_cleaned_column_resolvers', '_get_cython_func', '_get_index_resolvers', '_get_item_cache', '_get_label_or_level_values', '_get_numeric_data', '_get_value', '_get_values', '_getitem_bool_array', '_getitem_multilevel', '_gotitem', '_iget_item_cache', '_indexed_same', '_info_axis', '_info_axis_name', '_info_axis_number', '_info_repr', '_init_mgr', '_internal_get_values', '_internal_names', '_internal_names_set', '_is_builtin_func', '_is_cached', '_is_copy', '_is_datelike_mixed_type', '_is_homogeneous_type', '_is_label_or_level_reference', '_is_label_reference', '_is_level_reference', '_is_mixed_type', '_is_numeric_mixed_type', '_is_view', '_ix', '_ixs', '_join_compat', '_maybe_cache_changed', '_maybe_update_cacher', '_metadata', '_needs_reindex_multi', '_obj_with_exclusions', '_protect_consolidate', '_reduce', '_reindex_axes', '_reindex_columns', '_reindex_index', '_reindex_multi', '_reindex_with_indexers', '_repr_data_resource_', '_repr_fits_horizontal_', '_repr_fits_vertical_', '_repr_html_', '_repr_latex_', '_reset_cache', '_reset_cacher', '_sanitize_column', '_selected_obj', '_selection', '_selection_list', '_selection_name', '_series', '_set_as_cached', '_set_axis', '_set_axis_name', '_set_is_copy', '_set_item', '_set_value', '_setitem_array', '_setitem_frame', '_setitem_slice', '_setup_axes', '_slice', '_stat_axis', '_stat_axis_name', '_stat_axis_number', '_take_with_is_copy', '_to_dict_of_blocks', '_try_aggregate_string_function', '_typ', '_update_inplace', '_validate_dtype', '_values', '_where', '_xs', 'abs', 'add', 'add_prefix', 'add_suffix', 'agg', 'aggregate', 'align', 'all', 'any', 'append', 'apply', 'applymap', 'asfreq', 'asof', 'assign', 'astype', 'at', 'at_time', 'attrs', 'axes', 'between_time', 'bfill', 'bool', 'boxplot', 'clip', 'columns', 'combine', 'combine_first', 'convert_dtypes', 'copy', 'corr', 'corrwith', 'count', 'cov', 'cummax', 'cummin', 'cumprod', 'cumsum', 'describe', 'diff', 'div', 'divide', 'dot', 'drop', 'drop_duplicates', 'droplevel', 'dropna', 'dtypes', 'duplicated', 'empty', 'eq', 'equals', 'eval', 'ewm', 'expanding', 'explode', 'ffill', 'fillna', 'filter', 'first', 'first_valid_index', 'floordiv', 'from_dict', 'from_records', 'ge', 'get', 'groupby', 'gt', 'head', 'hist', 'iat', 'idxmax', 'idxmin', 'iloc', 'index', 'infer_objects', 'info', 'insert', 'interpolate', 'isin', 'isna', 'isnull', 'items', 'iteritems', 'iterrows', 'itertuples', 'join', 'keys', 'kurt', 'kurtosis', 'last', 'last_valid_index', 'le', 'loc', 'lookup', 'lt', 'mad', 'mask', 'max', 'mean', 'median', 'melt', 'memory_usage', 'merge', 'min', 'mod', 'mode', 'mul', 'multiply', 'ndim', 'ne', 'nlargest', 'notna', 'notnull', 'nsmallest', 'nunique', 'pct_change', 'pipe', 'pivot', 'pivot_table', 'plot', 'pop', 'pow', 'prod', 'product', 'quantile', 'query', 'radd', 'rank', 'rdiv', 'reindex', 'reindex_like', 'rename', 'rename_axis', 'reorder_levels', 'replace', 'resample', 'reset_index', 'rfloordiv', 'rmod', 'rmul', 'rolling', 'round', 'rpow', 'rsub', 'rtruediv', 'sample', 'select_dtypes', 'sem', 'set_axis', 'set_index', 'shape', 'shift', 'size', 'skew', 'slice_shift', 'sort_index', 'sort_values', 'squeeze', 'stack', 'std', 'style', 'sub', 'subtract', 'sum', 'swapaxes', 'swaplevel', 'tail', 'take', 'to_clipboard', 'to_csv', 'to_dict', 'to_excel', 'to_feather', 'to_gbq', 'to_hdf', 'to_html', 'to_json', 'to_latex', 'to_markdown', 'to_numpy', 'to_parquet', 'to_period', 'to_pickle', 'to_records', 'to_sql', 'to_stata', 'to_string', 'to_timestamp', 'to_xarray', 'transform', 'transpose', 'truediv', 'truncate', 'tshift', 'tz_convert', 'tz_localize', 'unstack', 'update', 'values', 'var', 'where', 'xs']

In [166]:
pop_data['Population'] = pop_data_pop

pop_data

     Year Debt  Tax_Rate       State  Population
1  2000.0    A      12.0        Ohio         1.7
2  2000.0    B      22.0      Nevada         1.9
3  2000.0    C      18.0  California         2.5
4  2001.0    D      18.0        Ohio         1.9
5  2001.0    E      18.0      Nevada         2.0
6  2001.0    F      18.0  California         2.9

#### Indexing, Selection, and Filtering

Series indexing (obj[...]) works analogously to NumPy array indexing, except you can use the
Series’s index values instead of only integers. Here are some examples of this:

In [167]:
series = pd.Series(list(range(0,500,100)), index = list('abcde'))
series

a      0
b    100
c    200
d    300
e    400
dtype: int64

In [168]:
series['b']

100

In [169]:
series[1]

100

In [170]:
series[['b','c']]

b    100
c    200
dtype: int64

In [171]:
series[[1,2]]

b    100
c    200
dtype: int64

In [172]:
series[['b', 'e']]

b    100
e    400
dtype: int64

In [173]:
series[[1,4]]

b    100
e    400
dtype: int64

In [174]:
series['b':'e']

b    100
c    200
d    300
e    400
dtype: int64

In [175]:
series[1:4]

b    100
c    200
d    300
dtype: int64

Note that with labels - the last element is inclusive unlike with integer type subscription.

Assigning using slicing modifies the corresponding section of the series

In [176]:
series['a':'c'] = 100,150,175

In [178]:
series

a    100
b    150
c    175
d    300
e    400
dtype: int64

In [179]:
series[0:4] = 0,100,200,300
series

a      0
b    100
c    200
d    300
e    400
dtype: int64

Negative indexing with Pandas indexes gets a little tricky since it can accept both labels and positions. When we use negative index to select an entry from a dataframe which has integers as indices, Pandas is not sure if we want Positional
or label index value. Therefore, it is highly recommened to use loc for label based indexing and iloc for position based

In [180]:
series3 = pd.Series(list(range(0,500,100)), index = list(range(5)))
series3

0      0
1    100
2    200
3    300
4    400
dtype: int64

In [181]:
series3[-1]

KeyError: -1

In [182]:
series3[4]

400

In [183]:
series3.iloc[-1]

400

In [184]:
series

a      0
b    100
c    200
d    300
e    400
dtype: int64

In [185]:
series[-1]

400

Here, using negative indexing on an non-integer index works because there is no ambiguity.

In [186]:
series1 = pd.Series(list(range(0,50,10)), index = list('abcde'))
print(series1)
print(series)

a     0
b    10
c    20
d    30
e    40
dtype: int64
a      0
b    100
c    200
d    300
e    400
dtype: int64

In [187]:
dataf = pd.DataFrame()
print(dataf)

Empty DataFrame
Columns: []
Index: []

In [188]:
dataf['Hundreds'] = series
dataf['Tens'] = series1 

dataf

   Hundreds  Tens
a         0     0
b       100    10
c       200    20
d       300    30
e       400    40

In [189]:
dataf['Hundreds']

a      0
b    100
c    200
d    300
e    400
Name: Hundreds, dtype: int64

In [190]:
dataf[1]

KeyError: 1

In [191]:
dataf['b']

KeyError: 'b'

In [192]:
dataf['Hundreds']

a      0
b    100
c    200
d    300
e    400
Name: Hundreds, dtype: int64

As we see above, the df['label'] syntax on a dataframe is exclusively for selection of columns based on labels.

On a dataframe, besides the above two options (choosing a row based on index labels as long as they are non-integer indices and columns based on column names), for the rest we use loc and iloc. 

loc is for choosing rows and columns based on their label
iloc is for choosing rows and columns based on their index positions.

The first section of the loc or iloc syntax is for rows and the second section(after comma) is for columns.

In [193]:
dataf

   Hundreds  Tens
a         0     0
b       100    10
c       200    20
d       300    30
e       400    40

In [194]:
dataf.loc['a']

Hundreds    0
Tens        0
Name: a, dtype: int64

In [195]:
dataf.loc['c', 'Tens']

20

In [196]:
dataf.loc['b':'d', 'Tens']

b    10
c    20
d    30
Name: Tens, dtype: int64

In [197]:
dataf.loc['b':'d', 'Hundreds':'Tens']

   Hundreds  Tens
b       100    10
c       200    20
d       300    30

### iloc

In [198]:
dataf

   Hundreds  Tens
a         0     0
b       100    10
c       200    20
d       300    30
e       400    40

In [199]:
dataf.iloc[1:4]

   Hundreds  Tens
b       100    10
c       200    20
d       300    30

In [200]:
dataf.iloc[1:4, 0]

b    100
c    200
d    300
Name: Hundreds, dtype: int64

In [201]:
dataf.iloc[4, 1]

40

In [202]:
dataf.iloc[4, :]

Hundreds    400
Tens         40
Name: e, dtype: int64

In [203]:
dataf.iloc[:,1]

a     0
b    10
c    20
d    30
e    40
Name: Tens, dtype: int64

In [204]:
dataf.iloc[:,1] = 0

In [205]:
dataf

   Hundreds  Tens
a         0     0
b       100     0
c       200     0
d       300     0
e       400     0

Arithmetic methods on DataFrames

In [206]:
dataf1 = dataf.add(10)
dataf1

   Hundreds  Tens
a        10    10
b       110    10
c       210    10
d       310    10
e       410    10

Note again that the original dataframe is not modified. The return has to be saved to a new variable. The operation can be
performed between dataframes as well. The operation will be performed on values with corresponding label and columns.

In [207]:
dataf

   Hundreds  Tens
a         0     0
b       100     0
c       200     0
d       300     0
e       400     0

In [208]:
dataf1

   Hundreds  Tens
a        10    10
b       110    10
c       210    10
d       310    10
e       410    10

In [209]:
dataf_add = dataf.add(dataf1)
dataf_add

   Hundreds  Tens
a        10    10
b       210    10
c       410    10
d       610    10
e       810    10

In [210]:
dataf3 = dataf_add.copy()
dataf3['Ones'] = list(range(10))
dataf3

ValueError: Length of values does not match length of index

In [ ]:
dataf3

In [211]:
dataf_add

   Hundreds  Tens
a        10    10
b       210    10
c       410    10
d       610    10
e       810    10

In [212]:
dataf_add2 = dataf_add.add(dataf3)

dataf_add2

   Hundreds  Tens
a        20    20
b       420    20
c       820    20
d      1220    20
e      1620    20

In [213]:
dataf3.loc[[8,9],'Ones'] = None
dataf3

KeyError: "None of [Int64Index([8, 9], dtype='int64')] are in the [index]"

In [214]:
dataf_add2 = dataf_add2[['Hundreds', 'Tens', 'Ones']]
dataf_add2.drop([8,9], inplace = True)

KeyError: "['Ones'] not in index"

In [215]:
dataf_add2

   Hundreds  Tens
a        20    20
b       420    20
c       820    20
d      1220    20
e      1620    20

Other methods similar to add method are :

sub,
mul,
div,
floordiv,
mod,
pow

In [216]:
dataf_add2.shape

(5, 2)

In [217]:
dataf_add2['Ones'] = np.random.randint(-10,10,8, dtype = int)
dataf_add2['Hundreds'] = np.random.randint(-1000,1000,8, dtype = int)
dataf_add2['Tens'] = np.random.randint(-100,100,8, dtype = int)
dataf_add2

ValueError: Length of values does not match length of index

numpy functions also work on dataframes or series objects.

We can use at(for label) or iat(for index position) to update values of a single cell.

In [218]:
dataf_add2.iat[2,0] = np.abs(dataf_add2.iloc[2,0])
dataf_add2

   Hundreds  Tens
a        20    20
b       420    20
c       820    20
d      1220    20
e      1620    20

In [ ]:
dataf_add2.index = list('abcdefgh')

In [ ]:
dataf_add2

In [ ]:
dataf_add2.at['b','Tens'] = np.abs(dataf_add2.loc['b','Tens'])
dataf_add2

In [ ]:
dataf_add2.loc['h','Hundreds'] = np.abs(dataf_add2.loc['h','Hundreds'])
dataf_add2

In [ ]:
dataf_add2.loc[:,'Hundreds'] = np.abs(dataf_add2.loc[:,'Hundreds'])
dataf_add2

In [ ]:
dataf_add2 = np.abs(dataf_add2)
dataf_add2

We can also apply functions using the apply method to either rows, columns or the full dataframe.

In [ ]:
dataf_add2['Hundreds'] = dataf_add2['Hundreds'].apply(lambda x : x/5)
dataf_add2

In [ ]:
dataf_add2['Ones'] = dataf_add2.apply(lambda x : x['Ones']+10, axis = 1)
dataf_add2

In [ ]:
dataf_add2.loc['c'] = dataf_add2.loc['c'].apply(lambda x : x*10)
dataf_add2

In [ ]:
dataf_add2 = dataf_add2.apply(lambda x : x/2)
dataf_add2

We can perform sorting on the dataframe based on index or columns.

In [ ]:
dataf_add2.index = list('ghlkdeba')
dataf_add2

In [ ]:
dataf_add2 = dataf_add2.sort_index() # By default sorts on axis 0 i.e. rows
dataf_add2

In [ ]:
dataf_add2 = dataf_add2.sort_index(axis = 1)
dataf_add2

By default, it is sorted in ascending order but can be set to descending order.

In [ ]:
dataf_add2 = dataf_add2.sort_index(ascending=False)
dataf_add2

In [ ]:
dataf_add2 = dataf_add2.sort_index(ascending = False, axis = 1)
dataf_add2

To sort by values, use the sort_values method

In [ ]:
dataf_add2 = dataf_add2.sort_values('Tens', axis = 0, ascending = True)
dataf_add2

In [ ]:
dataf_add2 = dataf_add2.sort_values('k', axis = 1, ascending = False)
dataf_add2

Rank method

In [ ]:
dataf_add2['Rank'] = dataf_add2['Tens'].rank()
dataf_add2

By default, takes mean rank if one or more values are tied.

With the 'method' parameter set to 'first' assigns first observation to one value and next value for the next tied value.

In [ ]:
dataf_add2['Rank_First'] = dataf_add2['Tens'].rank(method = 'first')
dataf_add2

In [ ]:
dataf_add2['Rank_Dense'] = dataf_add2['Tens'].rank(method = 'dense')
dataf_add2

Using parameter as 'dense' both tied values are assigned the same number and the next value is assigned the immediately succeeding value (no skipping of rank numbers).

Pandas does not prohibit you from using non unique values in the index. However, it becomes problematic when selecting or performing operations on data.

In [ ]:
dataf_add2.index = list('abacddef')
dataf_add2

In [ ]:
dataf_add2.loc['a']

In [ ]:
dataf_add2.loc['a'] = dataf_add2.loc['a'].add(10)
dataf_add2

Here although this was a simple operation where we were able to add 10 to both the rows marked with label 'a'(which may not have been the desired result in the first place), in more complex calculations and where the operations become ambiguous, errors will be raised.

In [ ]:
dataf_add2.loc['g'] = dataf_add2.loc['b']
dataf_add2

In [ ]:
dataf_add2.loc['h'] = dataf_add2.loc['a']

describe method on the dataframe outputs the statistical data of numerical columns such as count, mean, std, min, max and the values at 25%, 50%, 75%

In [ ]:
dataf_add2.describe()

info method outputs information about the values contained in the dataframe

In [ ]:
dataf_add2.info()

Unique method on a series(not on a dataframe) outputs the unique values contained in the series values and nunique outputs the number of unique outputs

In [ ]:
dataf_add2['Hundreds'].unique()

In [ ]:
dataf_add2['Hundreds'].nunique()

In [ ]:
dataf_add2.loc[:,'Hundreds'] = list('abcdefghi')

In [ ]:
dataf_add2

isna method returns True only if the value in the cell, series or dataframe is None or Numpy.NaN. All other values including empty strings and infinity are mapped to False.

isnull method is only an alias for isna method but somehow is used more often.

In [ ]:
dataf_add2.isna()

In [ ]:
dataf_add2.isnull()

In [ ]:
dataf_add2['Ones'].isnull()

In [ ]:
dataf_add2.loc['d'] = None

dataf_add2

In [ ]:
dataf_add2.isnull()

fillna method is used to fill the missing values with value of our choice. It can also take a dictionary as values mapping
NaN values in a particular column to particular value.

In [ ]:
dataf_add2.fillna(0, inplace = True)
dataf_add2

In [ ]:
dataf_add2['Hundreds'] = list('dedcaabff')
dataf_add2

get_dummies method in Pandas performs one-hot encoding on specified column(s).

In [ ]:
dataf_1hotencoded = pd.get_dummies(dataf_add2, prefix = 'H', columns = ['Hundreds'])
dataf_1hotencoded

In [ ]:
dataf_add2

In [ ]:
columnsdf = list(dataf_add2.columns)
columnsdf

In [ ]:
columnsdf.pop(0)
columnsdf

In [ ]:
for x in columnsdf:
    dataf_add2.loc['sum',x] = np.sum(dataf_add2[x].sum())

In [ ]:
dataf_add2

Concat method in Pandas

In [ ]:
series1 = pd.Series(list(range(0,100,10)), index = list(range(10)))
series1

In [ ]:
series2 = pd.Series(np.array(list(range(10,20)))+1, index = list(range(10)))
series2

In [ ]:
series3 = pd.Series(np.array(list(range(10,20)))+5, index = list(range(10)))
series3

In [ ]:
series4 = pd.Series(np.array(list(range(100,200,10)))+1, index = list(range(10)))
series4

In [ ]:
dataf1 = pd.concat([series1,series2], axis = 1)
dataf1

In [ ]:
dataf1.columns = ['A', 'B']
dataf1

In [ ]:
dataf2 = pd.concat([series3, series4], axis = 0,ignore_index=True )
dataf2

In [ ]:
dataf2

In [ ]:
dataf1

In [ ]:
dataf3 = pd.concat([dataf2, dataf1], axis = 1)
dataf3

In [ ]:
dataf4 = pd.concat([series3, series4], axis = 1)
dataf4.columns = ['C', 'D']

dataf4

In [ ]:
dataf5 = pd.concat([dataf1, dataf4], axis = 1)
dataf5

In [ ]:
series5 = pd.Series([11,2,13,4,15,6,17,8,19,0])
series5

In [ ]:
dataf6 = pd.concat([series5,series4], axis = 1)
dataf6.columns = ['C', 'D']
dataf6

In [ ]:
dataf1

In [ ]:
dataf7 = dataf1.copy()
dataf7

In [ ]:
dataf7

In [ ]:
dataf6

In [ ]:
dataf8 = dataf7.merge(dataf6, left_on='B', right_on='C') # Default inner join
dataf8

In [ ]:
dataf9 = dataf7.merge(dataf6, left_on = 'B', right_on = 'C', how = 'outer')
dataf9

#### read_csv function reads csv or excel files and loads them into the dataframe

In [ ]:
import pandas as pd
pd.set_option('display.max_columns', None)
dataframe = pd.read_csv('hotel_bookings.csv')

In [ ]:
dataframe

read_csv has several parameters of which important ones are:

- filepath_or_buffer - which is the only mandatory parameter
- delimiter=None - in case the csv file comes with a special delimiter such as tab(\t). However, even in those cases read_csv will usually infer the delimiter.
- header='infer' - Header names / Column names are inferred as long as column names are not explicitly passed. If column names explicitly passed - header needs to be set to 0
- names=<no_default> - list of column names to use. If explicitly specified, set header to 0 and skip the header row from dataframe loading.
- index_col=None - in case we wish to specify the column name from csv sheet to be used as index
- usecols=None - List-Like - Can be positional indices [0,1,7,9] or strings which are labels of column names from names or header ['X', 'Y','Z']. Will only load these columns into dataframe.
- skiprows=None - Any row numbers we wish to skip while loading (0 indexed)

#### read_excel (to read excel files) has mostly similar functionality to read_csv with one important addtion :

sheet_name - an optional parameter through which you can specify the sheet name to be loaded as a string. E.g. 'Sheet1'

If you have multiple sheets in an excel sheet, you can use the sheet names to load the dataframes and then concatenate them into one dataframe.

In [ ]:
import pandas as pd

excel_df10s = pd.read_excel('test_file.xlsx', skiprows = 2)
excel_df10s

In [ ]:
excel_df100s = pd.read_excel('test_file.xlsx', sheet_name = 'Hundreds', skiprows = 2)
excel_df100s

In [ ]:
dataframe.columns

In [ ]:
dataframe['market_segment'].unique()

In [ ]:
pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)

In [ ]:
import IPython 
from IPython.display import display

df_market_seg = dataframe.groupby('market_segment')

In [ ]:
df_market_seg

In [ ]:
df_market_seg.apply(print)

In [ ]:
df_ms = df_market_seg['hotel'].count().reset_index()

In [ ]:
df_ms

In [ ]:
print(type(df_ms))

In [ ]:
display

### pivot_table creates a spreadsheet type pivot table.

In [ ]:
df_pt = pd.pivot_table(dataframe, values = 'is_canceled', columns = 'distribution_channel', index = ['hotel','market_segment'],\
aggfunc = 'count')

In [ ]:
df_pt

### Crosstab - creates a frequency table of the specified rows and columns

In [ ]:
dataframe['country']

In [ ]:
df_ct = pd.crosstab(dataframe.country, dataframe.hotel)

df_ct

In [ ]:
print(dir(pd))